UNIT4/w20d1/instructor_examples/songs_app_api/app/controllers/songs_controller.rb

    def index
        # render json: ActiveRecord::Base.connection.execute('SELECT * FROM songs;')
        songs = Song.all
---
SELECT "songs".* FROM "songs"

    def show
        # http://localhost:3000/songs/1
        puts params
        song = Song.find(params[:id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]