UNIT4/RAILS-CONTROLLERS/songs_app_api/app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
    def index
        #render json: ActiveRecord::Base.connection.execute('SELECT * FROM songs;')
        songs = Song.all

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def show
        #http://127.0.0.1:3000/songs/1
        puts params
        song = Song.find(params[:id])

INSERT INTO "songs" ("title", "artist_name", "artwork") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Fav Song"], ["artist_name", "Andrei"], ["artwork", "None"]]
---
    def create
        song = Song.new(song_params)

        if song.save

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "songs" SET "artist_name" = $1 WHERE "songs"."id" = $2  [["artist_name", "Andrei's Song"], ["id", 3]]
---
      def update
        song = Song.find(params[:id])
        song.update(song_params)

DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 1]]
---
      def destroy
        song = Song.destroy(params[:id])