UNIT4/RailsPractice-books_app/books_app_api/app/controllers/books_controller.rb

    def index
        render json: { status: "Everything is working fine", books: Book.all}
---
SELECT "books".* FROM "books"

    def show
        found_book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

    def create
        book = Book.new(book_params)
        if book.save
---
INSERT INTO "books" ("title", "author", "genre", "publisher", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "temp1"], ["author", "Andrei_test"], ["genre", "genre test"], ["publisher", "publisher test"], ["created_at", "2020-04-25 19:02:28.215914"], ["updated_at", "2020-04-25 19:02:28.215914"]]