UNIT4/_one-to-many-PROJECT/temperatures_api/app/controllers/temperatures_controller.rb

INSERT INTO "temperatures" ("average_high_f", "average_low_f", "month", "created_at", "updated_at", "location_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["average_high_f", -8], ["average_low_f", -13], ["month", "February"], ["created_at", "2020-05-02 16:25:52.757920"], ["updated_at", "2020-05-02 16:25:52.757920"], ["location_id", 2]]
---
  def create
    @temperature = Temperature.new(temperature_params)
    if @temperature.save